<p></p><img src="https://i.pinimg.com/originals/59/8e/c4/598ec42e15c85716c6954c26840d4f4b.jpg" style="width: 100px"/>
<a href="https://github.com/sqrt495?tab=repositories" target="_parent">
    <h4><center><font color=black>Open In GitHub</font></center></h4></a>
<p></p>

In [1]:

from sklearn import datasets
from sklearn import metrics
from sklearn.naive_bayes import GaussianNB

dataset = datasets.load_iris()

In [4]:
dataset.target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [5]:
model = GaussianNB()
model.fit(dataset.data, dataset.target)

GaussianNB(priors=None, var_smoothing=1e-09)

In [6]:

expected = dataset.target
predicted = model.predict(dataset.data)

In [7]:

print(metrics.classification_report(expected, predicted))
print(metrics.confusion_matrix(expected, predicted))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00        50
           1       0.94      0.94      0.94        50
           2       0.94      0.94      0.94        50

   micro avg       0.96      0.96      0.96       150
   macro avg       0.96      0.96      0.96       150
weighted avg       0.96      0.96      0.96       150

[[50  0  0]
 [ 0 47  3]
 [ 0  3 47]]

In [17]:
import pandas as pd

[How to Create Pandas Dataframe from Multiple Lists?](https://cmdlinetips.com/2018/01/how-to-create-pandas-dataframe-from-multiple-lists/)

In [1]:
?df.str.contains

Object `df.str.contains` not found.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.contains.html


https://www.interviewqs.com/ddi_code_snippets/col_contains_pandas

https://www.pythonprogramming.in/if-value-in-row-in-dataframe-contains-string-create-another-column-equal-to-string-in-pandas.html

5 ways to apply an IF condition in pandas DataFrame

https://datatofish.com/if-condition-in-pandas-dataframe/

isin and not isin

https://stackoverflow.com/questions/19960077/how-to-filter-pandas-dataframe-using-in-and-not-in-like-in-sql

In [18]:
%time
df = pd.read_html('http://www.cbr.ru')[3]
# выводит все таблицы с сайта, здесь 4-я по счету ЦБ

Wall time: 0 ns

In [19]:
%%time
df

Wall time: 0 ns

  рублей за грамм 11.01.2020
0       Золото Au   3 050,60
1      Серебро Ag       3528
2      Платина Pt   1 916,48
3     Палладий Pd   4 175,67

In [20]:
type(df.values)

numpy.ndarray

In [21]:
df.dtypes.value_counts()

object    2
dtype: int64

* [Аналитикам: большая шпаргалка по Pandas](https://smysl.io/blog/pandas/)

In [22]:
%time
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы

df2 = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

Wall time: 0 ns

In [23]:
df2[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  11.01.20    610245    610245    610245   610245
 1  10.01.20    610245    613000    613850   608833
 2  09.01.20    613012    612395    614041   611216
 3  08.01.20    612250    620030    621430   610750
 4  07.01.20    619792    617997    621105   616100
 5  06.01.20    617835    621980    623450   617420
 6  05.01.20    621990    622745    624995   621985
 7  03.01.20    620695    617327    622355   617142
 8  02.01.20    617213    621968    621968   615700,
        Имя  Unnamed: 1    %    курс                 Дата
 0  EUR/RUB         NaN    0  678685  11.01.2020 12:44:00
 1  USD/RUB         NaN    0  610245  11.01.2020 12:44:00
 2  CHF/RUB         NaN   52   62757  11.01.2020 15:29:00
 3  JPY/RUB         NaN   -5    5577  11.01.2020 15:29:00
 4  GBP/RUB         NaN -185  797225  11.01.2020 15:29:00
 5  NOK/RUB         NaN -357   68675  11.01.2020 15:29:00
 6  AUD/RUB         NaN -146  421118  11.01.2020 15:29:00
 7  NZD/RUB         NaN    7  404849  11.01.2020 15:29:00
 8  TRY/RUB         NaN   21  103853  11.01.2020 15:29:00]

In [24]:
type(df2)

list

In [25]:
len(df2)

2

In [26]:
a = df2[0]
b = df2[1]

print(f'тип первого номера списка:\n',
      {type(a)},
      '\n\nвторой номер списка:\n\n',
      b)

тип первого номера списка:
 {<class 'pandas.core.frame.DataFrame'>}

второй номер списка:

        Имя  Unnamed: 1    %    курс                 Дата
0  EUR/RUB         NaN    0  678685  11.01.2020 12:44:00
1  USD/RUB         NaN    0  610245  11.01.2020 12:44:00
2  CHF/RUB         NaN   52   62757  11.01.2020 15:29:00
3  JPY/RUB         NaN   -5    5577  11.01.2020 15:29:00
4  GBP/RUB         NaN -185  797225  11.01.2020 15:29:00
5  NOK/RUB         NaN -357   68675  11.01.2020 15:29:00
6  AUD/RUB         NaN -146  421118  11.01.2020 15:29:00
7  NZD/RUB         NaN    7  404849  11.01.2020 15:29:00
8  TRY/RUB         NaN   21  103853  11.01.2020 15:29:00

In [27]:
a

       Дата  Закрытие  Открытие  Максимум  Минимум
0  11.01.20    610245    610245    610245   610245
1  10.01.20    610245    613000    613850   608833
2  09.01.20    613012    612395    614041   611216
3  08.01.20    612250    620030    621430   610750
4  07.01.20    619792    617997    621105   616100
5  06.01.20    617835    621980    623450   617420
6  05.01.20    621990    622745    624995   621985
7  03.01.20    620695    617327    622355   617142
8  02.01.20    617213    621968    621968   615700

In [28]:
a.shape

(9, 5)

In [29]:
a.dtypes.value_counts()

int64     4
object    1
dtype: int64

In [30]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Дата        9 non-null object
Закрытие    9 non-null int64
Открытие    9 non-null int64
Максимум    9 non-null int64
Минимум     9 non-null int64
dtypes: int64(4), object(1)
memory usage: 440.0+ bytes

In [31]:
# экспресс-расчет распределения числовых значений

a.describe()

            Закрытие       Открытие       Максимум        Минимум
count       9.000000       9.000000       9.000000       9.000000
mean   615919.666667  617520.777778  619271.000000  614376.777778
std      4559.517464    4652.465093    5162.929595    4336.793250
min    610245.000000  610245.000000  610245.000000  608833.000000
25%    612250.000000  613000.000000  614041.000000  610750.000000
50%    617213.000000  617997.000000  621430.000000  615700.000000
75%    619792.000000  621968.000000  622355.000000  617142.000000
max    621990.000000  622745.000000  624995.000000  621985.000000

## Структуры данных: серии и датафреймы


**Серии — одномерные массивы данных. Они очень похожи на списки, но отличаются по поведению — например, операции применяются к списку целиком, а в сериях — поэлементно.**


То есть, если список умножить на 2, получите тот же список, повторенный 2 раза.

In [32]:
vector = [1, 2, 3]
vector * 2

[1, 2, 3, 1, 2, 3]

А если умножить серию, ее длина не изменится, а вот элементы удвоятся.

In [33]:
series = pd.Series([1, 2, 3])
series * 2

0    2
1    4
2    6
dtype: int64

In [34]:
months = ['jan', 'feb', 'mar', 'apr']
sales = [100, 200, 300, 400]
data = pd.Series(data=sales, index=months)
data

jan    100
feb    200
mar    300
apr    400
dtype: int64

In [35]:
 data['feb']

200

#### Вернемся к `a` и `b`

In [36]:
a

       Дата  Закрытие  Открытие  Максимум  Минимум
0  11.01.20    610245    610245    610245   610245
1  10.01.20    610245    613000    613850   608833
2  09.01.20    613012    612395    614041   611216
3  08.01.20    612250    620030    621430   610750
4  07.01.20    619792    617997    621105   616100
5  06.01.20    617835    621980    623450   617420
6  05.01.20    621990    622745    624995   621985
7  03.01.20    620695    617327    622355   617142
8  02.01.20    617213    621968    621968   615700

In [37]:
b

       Имя  Unnamed: 1    %    курс                 Дата
0  EUR/RUB         NaN    0  678685  11.01.2020 12:44:00
1  USD/RUB         NaN    0  610245  11.01.2020 12:44:00
2  CHF/RUB         NaN   52   62757  11.01.2020 15:29:00
3  JPY/RUB         NaN   -5    5577  11.01.2020 15:29:00
4  GBP/RUB         NaN -185  797225  11.01.2020 15:29:00
5  NOK/RUB         NaN -357   68675  11.01.2020 15:29:00
6  AUD/RUB         NaN -146  421118  11.01.2020 15:29:00
7  NZD/RUB         NaN    7  404849  11.01.2020 15:29:00
8  TRY/RUB         NaN   21  103853  11.01.2020 15:29:00

In [38]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Имя           9 non-null object
Unnamed: 1    0 non-null float64
%             9 non-null int64
курс          9 non-null int64
Дата          9 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 440.0+ bytes

Чтобы выбрать строки, значение столбца которых равно скаляру, `some_value`, используйте `==`

In [39]:
b.loc[b['Имя'] == 'NOK/RUB']

       Имя  Unnamed: 1    %   курс                 Дата
5  NOK/RUB         NaN -357  68675  11.01.2020 15:29:00

In [47]:
b[b['курс'] < 300000]

       Имя  Unnamed: 1    %    курс                 Дата
2  CHF/RUB         NaN   52   62757  11.01.2020 15:29:00
3  JPY/RUB         NaN   -5    5577  11.01.2020 15:29:00
5  NOK/RUB         NaN -357   68675  11.01.2020 15:29:00
8  TRY/RUB         NaN   21  103853  11.01.2020 15:29:00

Чтобы выбрать строки, чье значение столбца находится в итерируемой `some_values`, используйте `isin`.


Значения подаются в списке.

In [40]:
b.loc[b['Имя'].isin(['NOK/RUB', 'USD/RUB', 'NZD/RUB'])]

       Имя  Unnamed: 1    %    курс                 Дата
1  USD/RUB         NaN    0  610245  11.01.2020 12:44:00
5  NOK/RUB         NaN -357   68675  11.01.2020 15:29:00
7  NZD/RUB         NaN    7  404849  11.01.2020 15:29:00

### [дальше](https://overcoder.net/q/3301/%D0%B2%D1%8B%D0%B1%D0%B5%D1%80%D0%B8%D1%82%D0%B5-%D1%81%D1%82%D1%80%D0%BE%D0%BA%D0%B8-%D0%B2-dataframe-%D0%BD%D0%B0-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%B5-%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D0%BD%D0%B8%D0%B9-%D0%B2-%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D1%86%D0%B5-%D0%B2-%D0%BF%D0%B0%D0%BD%D0%B4%D0%B0%D1%85)

[Get all rows in a Pandas DataFrame containing given substring](https://www.geeksforgeeks.org/get-all-rows-in-a-pandas-dataframe-containing-given-substring/)

[Using iloc, loc, & ix to select rows and columns in Pandas DataFrames](https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/)

[How To Filter Pandas Dataframe By Values of Column?](https://cmdlinetips.com/2018/02/how-to-subset-pandas-dataframe-based-on-values-of-a-column/)

[Indexing and Selecting Data with Pandas](https://www.geeksforgeeks.org/indexing-and-selecting-data-with-pandas/)

[How to apply a function to two columns of Pandas dataframe](https://stackoverflow.com/questions/13331698/how-to-apply-a-function-to-two-columns-of-pandas-dataframe)

[Get column name where value is something in pandas dataframe](https://stackoverflow.com/questions/14734695/get-column-name-where-value-is-something-in-pandas-dataframe)

[Pandas: Apply a function to single or selected columns or rows in Dataframe](https://thispointer.com/pandas-apply-a-function-to-single-or-selected-columns-or-rows-in-dataframe/)

[Select by partial string from a pandas DataFrame](https://stackoverflow.com/questions/11350770/select-by-partial-string-from-a-pandas-dataframe)

## сложная функция, чтобы достать названия столюцов:

In [3]:
import pandas as pd
df = pd.DataFrame({'user_id': [1, 2, 3], 'clicks': [163, 130, 97], 'orders': [2, 4, 0],'orders2': [0, 1, 1]})
df

   user_id  clicks  orders  orders2
0        1     163       2        0
1        2     130       4        1
2        3      97       0        1

In [11]:
b = 0
def get_col_name(row):    
    return b.index

In [12]:
df.apply(get_col_name, axis=1)

AttributeError: ("'int' object has no attribute 'index'", 'occurred at index 0')